m = [["индекс","задача","категория","важность","срочность","выполнено"],
     [0,"побрить руки","личное","важно","срочно","нет"],
     [1,"причесать кота","дом","средне","срочно","да"],
     [2,"убраться в квартире","дом","низко","не срочно","нет"],
     [3,"вспомнить Д/З","учеба","средне","средне","нет"],
     [4,"вспомнить как зовут учителя","учеба","низко","не срочно","нет"]]
for i in m:
    for j in i:
        print(j, end='|')
    print()
a = input("что вы хотыте вывести список,добавить в список,удалить индекс?")
while a !="fdsfs":
    if a =="вывести список":
        for i in m:
            for j in i:
                print(j, end='|')
            print()
    if a =="убрать индекс":
        for sublist in m:
            del sublist[0]
    a = input()
    