a = [["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"],
     ["o","o","o","o","o","o","o","o","o","o"]]
o = 0
while o !="t":
    for i in a:
        print(i)
    h = int(input("напишите индекс столбца:"))
    j = int(input("напишите индекс строки:"))
    if a[h][j] == "o":
        a[h][j] = "b"
    else:
        a[h][j] = "o"
    for i in a:
        print(i)
    o = input("Введите t чтобы закончить либо нажмите на любую другую кнопку: ")